In [1]:
import pandas as pd
import numpy as np

In [2]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [3]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [5]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

Filtering out missing data

In [6]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [7]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                         [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [9]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [11]:
data.dropna(how="all") #Passing how="all" will drop only rows that are all NA:

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [12]:
data[4]=np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [13]:
data.dropna(axis="columns",how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))
df

          0         1         2
0  0.057762  2.298400 -0.315641
1 -0.911511 -0.879994 -0.205462
2 -0.260936 -1.820338  0.479462
3 -0.612831 -0.683554 -0.123687
4  0.974335 -0.026294  0.468685
5 -0.101231  0.087014  0.097853
6  1.098831  1.989653 -1.344481

In [15]:
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan

In [16]:
df

          0         1         2
0  0.057762       NaN       NaN
1 -0.911511       NaN       NaN
2 -0.260936       NaN  0.479462
3 -0.612831       NaN -0.123687
4  0.974335 -0.026294  0.468685
5 -0.101231  0.087014  0.097853
6  1.098831  1.989653 -1.344481

In [17]:
df.dropna()

          0         1         2
4  0.974335 -0.026294  0.468685
5 -0.101231  0.087014  0.097853
6  1.098831  1.989653 -1.344481

In [18]:
df.dropna(thresh=2)

          0         1         2
2 -0.260936       NaN  0.479462
3 -0.612831       NaN -0.123687
4  0.974335 -0.026294  0.468685
5 -0.101231  0.087014  0.097853
6  1.098831  1.989653 -1.344481

Filling in missing data

In [19]:
#Calling fillna with a constant replaces missing values with that value:
df.fillna(0)

          0         1         2
0  0.057762  0.000000  0.000000
1 -0.911511  0.000000  0.000000
2 -0.260936  0.000000  0.479462
3 -0.612831  0.000000 -0.123687
4  0.974335 -0.026294  0.468685
5 -0.101231  0.087014  0.097853
6  1.098831  1.989653 -1.344481

In [20]:
#Calling fillna with a dictionary, you can use a different fill value for each column:
df.fillna({1:0.5,2:0})

          0         1         2
0  0.057762  0.500000  0.000000
1 -0.911511  0.500000  0.000000
2 -0.260936  0.500000  0.479462
3 -0.612831  0.500000 -0.123687
4  0.974335 -0.026294  0.468685
5 -0.101231  0.087014  0.097853
6  1.098831  1.989653 -1.344481

In [22]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))
df

          0         1         2
0  0.537146 -1.025524  0.395361
1  0.237275 -0.846363  0.815343
2 -1.152551  0.861698  0.990152
3 -1.396310  0.041941 -0.693072
4 -0.819746 -0.581392 -0.647933
5 -0.277012 -0.320176  0.188752

In [23]:
df.iloc[2:,1]=np.nan
df.iloc[4:,2]=np.nan
df

          0         1         2
0  0.537146 -1.025524  0.395361
1  0.237275 -0.846363  0.815343
2 -1.152551       NaN  0.990152
3 -1.396310       NaN -0.693072
4 -0.819746       NaN       NaN
5 -0.277012       NaN       NaN

In [25]:
df.fillna(method="ffill")

          0         1         2
0  0.537146 -1.025524  0.395361
1  0.237275 -0.846363  0.815343
2 -1.152551 -0.846363  0.990152
3 -1.396310 -0.846363 -0.693072
4 -0.819746 -0.846363 -0.693072
5 -0.277012 -0.846363 -0.693072

In [26]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [28]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64